app/Services/ImportDataService.php

    private static function createMentor($column, $seasonStatus)
    {
        $seasonId = Season::where('name', $column[6])
            ->pluck('id')
            ->first();

        $mentor = Mentor::create([
            'name' => $column[0],
            'age' => $column[1],
            'email' => $column[2],
            'phone' => $column[3],
            'gender_id' => $column[4] == 'Мъж' ? 1 : 2,
            'previous_season_id' => $seasonId,
            'current_season_id' => self::findCurrentSeason($seasonStatus),
            'city_id' => self::findCity($column[7]),
            'education' => $column[8],
            'work' => $column[9],
            'experience' => $column[10],
            'expertise' => $column[11],
            'difficult_situations' => $column[12],
            'want_to_change' => $column[13],
            'hours' => (int)$column[14] ?: 5,
            'able_mentor_info' => $column[17],
        ]);

        $mentor->projectTypes()->attach(self::findProjectTypes($column[15]));
---
select `id` from `seasons` where `name` = 'Не съм бил досега.'
insert into `mentors_project_types` (`mentor_id`, `project_type_id`) values (102, 1), (102, 3)

    private static function createStudent($column, $seasonStatus)
    {
        $englishLevelId = EnglishLevel::where('level', 'like', '%' . $column[11] . '%')
            ->pluck('id')
            ->first();

        $sportId = Sport::where('name', 'like', '%' . $column[12] . '%')
            ->pluck('id')
            ->first();
---
select `id` from `english_levels` where `level` like '%Средно (B2)%'
select `id` from `sports` where `name` like '%кикбокс%'

            'able_mentor_info_source' => $column[22],
        ]);

        $student->projectTypes()->attach(self::findProjectTypes($column[21]));
---
insert into `students_project_types` (`project_type_id`, `student_id`) values (2, 101), (3, 101)

    private static function findCity($city) {
        return City::where('name', 'like', '%' . $city . '%')
            ->pluck('id')
            ->first();
---
select `id` from `cities` where `name` like '%София%'

    private static function findProjectTypes($types) {
        $projectTypes = ProjectType::all();
---
select * from `project_types`