<?php

use App\Sphere;
use Illuminate\Database\Seeder;

class SphereSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Sphere::insert([
            ['name' => 'Авиация'],
            ['name' => 'Автомобилна индустрия'],
            ['name' => 'Анимация'],
            ['name' => 'Архитектура'],
            ['name' => 'Библиотекарство и архивистика'],
            ['name' => 'Бижутерия'],
            ['name' => 'Дизайн, Криейтив'],
            ['name' => 'Държавна администрация'],
            ['name' => 'Европейски проекти'],
            ['name' => 'Екология'],
            ['name' => 'Енергетика'],
            ['name' => 'Земеделие'],
            ['name' => 'Изкуство'],
            ['name' => 'Инженерни науки'],
            ['name' => 'ИТ'],
            ['name' => 'Козметика, Фризьорство'],
            ['name' => 'Литература, Филология, Лингвистика'],
            ['name' => 'Маркетинг, Реклама и ПР'],
            ['name' => 'Медии (вкл. Социални медии) и Телекомуникации'],
            ['name' => 'Медицина и Фармация'],
            ['name' => 'Международни отношения'],
            ['name' => 'Мода'],
            ['name' => 'Музика'],
            ['name' => 'Наука'],
            ['name' => 'Образование'],
            ['name' => 'Организиране на събития'],
            ['name' => 'Политика'],
            ['name' => 'Право'],
            ['name' => 'Проектен мениджмънт'],
            ['name' => 'Предприемачество'],
            ['name' => 'Психология, Психотерапия, Коучинг'],
            ['name' => 'Ресторантьорство, Кулинария'],
            ['name' => 'Сектор Сигурност (армия, полиция, специални служби)'],
            ['name' => 'Социални и младежки дейности'],
            ['name' => 'Социология и Политология'],
            ['name' => 'Спорт и здравословен начин на живот'],
            ['name' => 'Строителство'],
            ['name' => 'Счетоводство и Финанси'],
            ['name' => 'Театър и Кино'],
            ['name' => 'Транспорт'],
            ['name' => 'Търговия и Продажби'],
            ['name' => 'Туризъм'],
            ['name' => 'Фотография, Видеография'],
            ['name' => 'Човешки ресурси'],
            ['name' => 'Друго'],
        ]);
    }
}
