<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Profile Information Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */

    'saveButton' => 'Запази',
    'savedMessage' => 'Запазено',
    'password' => 'Парола',

    /* profile */
    'profileTitle' => 'Профил',
    'profileInfoTitle' => 'Информация за профила',
    'profileInfoContent' => 'Актуализирайте информацията за профила и имейл адреса на вашия акаунт.',
    'name' => 'Име',

    /* Update Password */
    'updatePasswordTitle' => 'Актуализиране на паролата',
    'updatePasswordContent' => 'Уверете се, че вашият акаунт използва дълга, произволна парола, за да бъдете сигурни.',
    'currentPassword' => 'Настояща парола',
    'newPassword' => 'Нова парола',
    'confirmPassword' => 'Потвърди паролата',

    /* Two Factor Authentication */
    'twoFactorAuthTitle' => 'Двуфакторно удостоверяване',
    'twoFactorAuthContent' => 'Добавете допълнителна сигурност към вашия акаунт, като използвате двуфакторно удостоверяване.',
    'twoFactorMessageYes' => 'Активирали сте двуфакторно удостоверяване.',
    'twoFactorMessageNo' => 'Не сте активирали двуфакторно удостоверяване.',
    'twoFactorExplanation' => 'Когато е разрешено двуфакторно удостоверяване, по време на удостоверяването ще бъдете подканени за сигурен, произволен маркер. Можете да изтеглите този маркер от приложението Google Authenticator на телефона си.',
    'enableButton' => 'Активирай',

    /* active Two Factor Auth */
    'activeMessage' => 'Двуфакторното удостоверяване вече е активирано. Сканирайте следния QR кодя, като използвате приложението за удостоверяване на телефона си.',
    'activeCodeMessage' => 'Съхранявайте тези кодове за възстановяване в защитен мениджър на пароли. Те могат да се използват за възстановяване на достъпа до вашия акаунт, ако вашето двуфакторно устройство за удостоверяване е загубено.',
    'regenerateCodes' => 'Променете кодовете за въстановяване',
    'showRecoveryCodes' => 'Показване на кодовете за въстановяване',
    'disableButton' => 'Деактивирай',

    /* Browser Sessions */
    'browserSessionsTitle' => 'Сесии на Браузъра',
    'browserSessionsContent' => 'Управлявайте и излизайте от активните си сесии в други браузъри и устройства.',
    'browserSessionsMessage' => 'Ако е необходимо, можете да излезете от всички други сесии на браузъра си на всичките си устройства. Някои от последните ви сесии са изброени по-долу. Този списък обаче може да не е изчерпателен. Ако смятате, че акаунтът ви е компрометиран, трябва също да актуализирате паролата си.',
    'thisdeviceMessage' => 'Това устройство',
    'lastActiveMessage' => 'Последна активност',
    'logoutOtherBrowserSessions' => 'Изход от други сесии на браузъра',
    'logoutOtherSessionsMessage' => 'Моля, въведете паролата си, за да потвърдите, че искате да излезете от другите си сесии на браузъра на всичките си устройства.',
    'nevermindButton' => 'Отказ',
    'doneMessage' => 'Готово!',

    /* Delete Account */
    'deleteAccountTitle' => 'Итриване на акаунт',
    'deleteAccountContent' => 'Изтрийте за постоянно акаунта си.',
    'deleteAccountMessage' => 'След като акаунтът ви бъде изтрит, всички негови ресурси и данни ще бъдат изтрити за постоянно. Преди да изтриете акаунта си, моля, изтеглете всички данни или информация, които искате да запазите.',
    'deleteAccountButton' => 'Изтриване на акаунта',
    'modalDeleteAccountContent' => 'Наистина ли искате да изтриете акаунта си? След като акаунтът ви бъде изтрит, всички негови ресурси и данни ще бъдат изтрити за постоянно. Моля, въведете паролата си, за да потвърдите, че искате да изтриете окончателно акаунта си.',
];
