app/Http/Controllers/HomeController.php

select * from `students` where `season_id` = '4' and exists (select * from `mentors` inner join `mentors_students` on `mentors`.`id` = `mentors_students`.`mentor_id` where `students`.`id` = `mentors_students`.`student_id`)
select `mentors`.*, `mentors_students`.`student_id` as `pivot_student_id`, `mentors_students`.`mentor_id` as `pivot_mentor_id` from `mentors` inner join `mentors_students` on `mentors`.`id` = `mentors_students`.`mentor_id` where `mentors_students`.`student_id` in (100)
select `project_types`.*, `students_project_types`.`student_id` as `pivot_student_id`, `students_project_types`.`project_type_id` as `pivot_project_type_id` from `project_types` inner join `students_project_types` on `project_types`.`id` = `students_project_types`.`project_type_id` where `students_project_types`.`student_id` in (100)
---
    public function archive(Request $request)
    {
        $pastSeasons = Season::past()
            ->orderByDesc('id')
            ->get();

        $students = Student::with(['mentors', 'projectTypes', 'mentors.projectTypes'])
            ->where('season_id', $request->season ?: $pastSeasons->first()->id)
            ->whereHas('mentors')
            ->get();

update `users` set `mode` = 1, `users`.`updated_at` = '2022-01-06 16:09:33' where `id` = 1
---
    public function changeMode()
    {
        $oldMode = Auth::user()->mode;
        $newMode = $oldMode ? 0 : 1;

        Auth::user()->mode = $newMode;
        Auth::user()->save();