app/Http/Controllers/MentorController.php

select * from `mentors` where `current_season_id` = 17
---
    public function archive(Request $request)
    {
        $pastSeasons = Season::past()
            ->orderByDesc('id')
            ->get();

        $mentorsQuery = Mentor::query()
            ->withRelations();

        $mentorsQuery->where('current_season_id', $request->seasonId ?: $pastSeasons->first()->id);

        return view('mentors.index', [
            'mentors' => $mentorsQuery->get(),
            'pastSeasons' => $pastSeasons,
        ]);

select `id` from `seasons` where date(`start`) > '2021-11-28' and date(`end`) > '2021-11-28'
---
    public function create()
    {
        $seasons = Season::whereDate('start', '<=', Carbon::now())
            ->get();

        $newSeason = Season::with('cities')
            ->new()
            ->first();

        if (!$newSeason) {
            abort(404);
        }

        return view('mentors.create', [
            'cities' => $newSeason->cities,
            'genders' => Gender::all(),
            'projectTypes' => ProjectType::all(),
            'seasons' => $seasons,
            'spheres' => Sphere::all(),
        ]);

delete from `mentors` where `id` = 50
---
    public function destroy(Mentor $mentor)
    {
        $mentor->delete();