app/Http/Controllers/MentorController.php

select * from `mentors`
---
    public function index($status = null)
    {
    	$mentorsQuery = Mentor::query()
            ->withRelations();

        $mentorsQuery = MentorStudentService::mentorsFilter($status, $mentorsQuery);

        return view('mentors.index', [
            'mentors' => $mentorsQuery->get(),
        ]);

select * from `cities`
select * from `project_types`
select * from `genders`
select * from `seasons` where date(`start`) <= '2021-11-28'
---
    public function create()
    {
        $cities = City::all();
        $projectTypes = ProjectType::all();
        $genders = Gender::all();
        $seasons = Season::whereDate('start', '<=', Carbon::now())
            ->get();

insert into `mentors` (`name`, `age`, `email`, `phone`, `gender_id`, `previous_season_id`, `city_id`, `work`, `education`, `experience`, `expertise`, `difficult_situations`, `want_to_change`, `hours`, `able_mentor_info`, `current_season_id`, `cv_path`, `updated_at`, `created_at`) values ('sdadasdasd', '99', 'sdadasdasd@add', '08888888888', '1', '1', '2', 'sdadasdasd', 'sdadasdasd', 'sdadasdasd', 'sdadasdasd', 'sdadasdasd', 'sdadasdasd', '1', 'sdadasdasdsdadasdasd', '', 'f7399e0c-7cb2-4707-9044-3f5d69b44511.jpg', '2021-11-28 16:52:36', '2021-11-28 16:52:36')
insert into `mentors` (`name`, `age`, `email`, `phone`, `gender_id`, `previous_season_id`, `city_id`, `work`, `education`, `experience`, `expertise`, `difficult_situations`, `want_to_change`, `hours`, `able_mentor_info`, `current_season_id`, `cv_path`, `updated_at`, `created_at`) values ('jklkljkljkl', '99', 'hkjhk@gf', '0888888', '2', '4', '6', 'hkhjk', 'jhkjh', 'jhkhjk', 'jhkjkhjk', 'hjkjhk', 'jhkjk', '4', 'jhjkhjk', 19, 'cde57e54-eecc-4e74-b428-fbc56db90e81.jpg', '2021-11-28 19:08:31', '2021-11-28 19:08:31')
insert into `mentors_project_types` (`mentor_id`, `project_type_id`) values (119, '1'), (119, '2'), (119, '3')
---
    public function store(MentorRequest $request)
    {
        $newSeasonId = Season::new()
            ->pluck('id')
            ->first();

        $data = $request->all();

        unset($data['_token']);
        unset($data['project_type_ids']);

        $data['current_season_id'] = $newSeasonId;
        $data['cv_path'] = self::saveCV($request->cv);

        $mentor = new Mentor($data);
        $mentor->save();

        $mentor->projectTypes()->attach($request->project_type_ids);

select * from `mentors` where `mentors`.`id` = 60 limit 1
---
    public function show(Mentor $mentor)
    {
        $mentor = Mentor::withRelations()
            ->find($mentor->id);

select * from `cities`
select * from `project_types`
select * from `seasons`
---
    public function edit(Mentor $mentor)
    {
        $cities = City::all();
        $projectTypes = ProjectType::all();
        $seasons = Season::all();

select * from `students` where `season_id` = 18 and (not exists (select * from `mentors` inner join `mentors_students` on `mentors`.`id` = `mentors_students`.`mentor_id` where `students`.`id` = `mentors_students`.`student_id`) or exists (select * from `mentors` inner join `mentors_students` on `mentors`.`id` = `mentors_students`.`mentor_id` where `students`.`id` = `mentors_students`.`student_id` and `mentor_id` = 103)) and `hours` not in (2, 1, 3) and (not exists (select * from `project_types` inner join `students_project_types` on `project_types`.`id` = `students_project_types`.`project_type_id` where `students`.`id` = `students_project_types`.`student_id`) or exists (select * from `project_types` inner join `students_project_types` on `project_types`.`id` = `students_project_types`.`project_type_id` where `students`.`id` = `students_project_types`.`student_id` and `type` not in (1)))
select * from `cities` where `cities`.`id` in (177, 184, 212)
select `mentors`.*, `mentors_students`.`student_id` as `pivot_student_id`, `mentors_students`.`mentor_id` as `pivot_mentor_id` from `mentors` inner join `mentors_students` on `mentors`.`id` = `mentors_students`.`mentor_id` where `mentors_students`.`student_id` in (9, 15, 28)
select `project_types`.*, `students_project_types`.`student_id` as `pivot_student_id`, `students_project_types`.`project_type_id` as `pivot_project_type_id` from `project_types` inner join `students_project_types` on `project_types`.`id` = `students_project_types`.`project_type_id` where `students_project_types`.`student_id` in (9, 15, 28)
select `project_types`.*, `mentors_project_types`.`mentor_id` as `pivot_mentor_id`, `mentors_project_types`.`project_type_id` as `pivot_project_type_id` from `project_types` inner join `mentors_project_types` on `project_types`.`id` = `mentors_project_types`.`project_type_id` where `mentors_project_types`.`mentor_id` = 103
---
    public function students(Mentor $mentor)
    {
        $otherStudents = Student::with('city', 'mentors', 'projectTypes')
            ->where('season_id', $mentor->current_season_id)
            ->where(function ($q) use ($mentor) {
                $q->doesntHave('mentors')
                    ->orWhereHas('mentors', function ($query) use ($mentor) {
                        $query->where('mentor_id', $mentor->id);
                    });
            })->whereNotIn('hours', [
                $mentor->hours,
                $mentor->hours - 1,
                $mentor->hours + 1,
            ])->where(function ($q) use ($mentor) {
                $q->doesntHave('projectTypes')
                    ->orWhereHas('projectTypes', function ($q) use ($mentor) {
                        $q->whereNotIn('type', $mentor->projectTypes);
                    });
            })->get();

        $appropriateStudents = Student::with('city', 'mentors', 'projectTypes')
            ->where('season_id', $mentor->current_season_id)
            ->where(function ($q) use ($mentor) {
                $q->doesntHave('mentors')
                    ->orWhereHas('mentors', function ($query) use ($mentor) {
                        $query->where('mentor_id', $mentor->id);
                    });
            })->whereNotIn('id', $otherStudents->pluck('id'))
            ->get();