app/Http/Controllers/SeasonController.php

    public function index()
    {
        $seasons = Season::with('cities')
            ->where('id', '!=', 1)
            ->get();
---
select * from `seasons` where `id` != 1

    public function store(Request $request)
    {
        $season = new Season;

        $season->name = $request->name;
        $season->start = $request->start;
        $season->end = $request->end;
        $season->save();
---
insert into `seasons` (`name`, `start`, `end`, `updated_at`, `created_at`) values ('Сезон 18', '2022-07-07', '2023-01-06', '2022-01-06 16:13:59', '2022-01-06 16:13:59')