app/Http/Controllers/StudentController.php

select * from `students`
---
    public function index($status = null)
    {
        $studentsQuery = Student::query()
            ->withRelations();

        $studentsQuery = MentorStudentService::studentsFilter($status, $studentsQuery);

        return view('students.index', [
            'students' => $studentsQuery->get(),
        ]);

select * from `cities`
select * from `school_classes`
select * from `english_levels`
select * from `sports`
select * from `project_types`
select * from `genders`
---
    public function create()
    {
        $cities = City::all();
        $schoolClass = SchoolClass::all();
        $englishLevels = EnglishLevel::all();
        $sports = Sport::all();
        $projectTypes = ProjectType::all();
        $genders = Gender::all();

insert into `students_project_types` (`project_type_id`, `student_id`) values (1, 100)
---
    public function update(Student $student, StudentRequest $request)
    {
        $data = $request->all();

        unset($data['_token']);
        unset($data['project_type_ids']);

        $student->update($data);

        $student->projectTypes()->sync($request->project_type_ids);

select * from `students_project_types` where `student_id` = 100
select * from `cities` where `cities`.`id` in (178)
select `project_types`.*, `students_project_types`.`student_id` as `pivot_student_id`, `students_project_types`.`project_type_id` as `pivot_project_type_id` from `project_types` inner join `students_project_types` on `project_types`.`id` = `students_project_types`.`project_type_id` where `students_project_types`.`student_id` = 20
select `students`.*, `mentors_students`.`mentor_id` as `pivot_mentor_id`, `mentors_students`.`student_id` as `pivot_student_id` from `students` inner join `mentors_students` on `students`.`id` = `mentors_students`.`student_id` where `mentors_students`.`mentor_id` in (89)
---
    public function mentors(Student $student)
    {
        $otherMentors = Mentor::with('city', 'students')
            ->whereNotIn('hours', [
                $student->hours,
                $student->hours - 1,
                $student->hours + 1,
            ])->where(function ($q) use ($student) {
                $q->doesntHave('projectTypes')
                    ->orWhereHas('projectTypes', function ($q) use ($student) {
                        $q->whereNotIn('type', $student->projectTypes);
                    });
            })->get();

        $appropriateMentors = Mentor::with('city', 'students')
            ->whereNotIn('id', $otherMentors->pluck('id'))
            ->get();

delete from `students` where `id` = 101
---
    public function detachStudentMentor(Student $student, Mentor $mentor)
    {
        $student->mentors()->detach($mentor->id);