app/Http/Controllers/StudentController.php

    public function mentors(Student $student)
    {
        $otherMentors = Mentor::with('city', 'students')
            ->where('current_season_id', $student->season_id)
            ->whereNotIn('hours', [
                $student->hours,
                $student->hours - 1,
                $student->hours + 1,
            ])->where(function ($q) use ($student) {
                $q->where(function ($query) use ($student) {
                    $query->doesntHave('projectTypes')
                        ->orWhereHas('projectTypes', function ($q) use ($student) {
                            $q->whereNotIn('type', $student->projectTypes);
                        });
                })->orWhere(function ($query) use ($student) {
                    $query->doesntHave('spheres')
                        ->orWhereHas('spheres', function ($q) use ($student) {
                            $q->whereNotIn('name', $student->spheres);
                        });
                });
            })->get();
---
select * from `mentors` where `current_season_id` = 18 and `id` not in (89)