app/Http/Controllers/UserController.php

select * from `users` where `users`.`deleted_at` is null
---
    public function index()
    {
        $users = User::all();